chore: sync from Gitee (keep GitHub workflows)
